app/views/shared/_chart.html.erb

<%= javascript_include_tag "https://www.google.com/jsapi", "chartkick" %>
<% my_chart = Order.group_by_day(:created_at).count %>
---
SELECT COUNT(*) AS count_all, (DATE_TRUNC('month', ("orders"."created_at"::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC' AS date_trunc_month_orders_created_at_timestamptz_at_time_zone_etc FROM "orders" WHERE ("orders"."created_at" IS NOT NULL) GROUP BY (DATE_TRUNC('month', ("orders"."created_at"::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC'