app/controllers/billings_controller.rb

SELECT price * quantity FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."payed" = $2  [["user_id", 1], ["payed", "f"]]
---
  def pre_pay

    orders = current_user.orders.where(payed: false)

UPDATE "orders" SET "payed" = TRUE, "billing_id" = 3 WHERE "orders"."user_id" = $1 AND "orders"."payed" = $2  [["user_id", 5], ["payed", false]]
---
  def execute
    paypal_payment = PayPal::SDK::REST::Payment.find(params[:paymentId])
    if paypal_payment.execute(payer_id: params[:PayerID])
      amount = paypal_payment.transactions.first.amount.total
      billing = Billing.create(
        user: current_user,
        code: paypal_payment.id,
        payment_method: 'paypal',
        amount: amount,
        currency: 'USD'
      )
      orders = current_user.orders.where(payed: false)
      orders.update_all(payed: true, billing_id: billing.id)