app/controllers/orders_controller.rb

  def create
    p = Product.find(params[:product_id])
    o = Order.find_or_create_by(user: current_user, product: p, payed: false, price: p.price)
    o.quantity += 1

    if o.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["product_id", 1], ["created_at", "2019-10-01 17:57:15.927048"], ["updated_at", "2019-10-01 17:57:15.927048"], ["price", 90]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = 1 AND "orders"."product_id" = 1 AND "orders"."payed" = $1 AND "orders"."price" = $2 LIMIT $3  [["payed", "f"], ["price", 90], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = $1, "quantity" = $2 WHERE "orders"."id" = $3  [["updated_at", "2019-10-01 17:57:15.952597"], ["quantity", 1], ["id", 1]]

  def clean
    @orders = Order.where(user: current_user, payed: false)
    @orders.destroy_all
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."payed" = $2  [["user_id", 4], ["payed", false]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 9]]

  def index
    @orders = current_user.orders.where(payed: false)
    @total = @orders.pluck("price * quantity").sum()
---
SELECT price * quantity FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."payed" = $2  [["user_id", 1], ["payed", "f"]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."payed" = $2  [["user_id", 1], ["payed", "f"]]